# FolderItemInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FolderItemInfo Class
Members See Also
---
Contains data for each folder item in the organization settings of the project browser including folder parameter Id and folder name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class FolderItemInfo : IDisposable
```

Visual Basic
---
```text
Public Class FolderItemInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FolderItemInfo : IDisposable
```

# Remarks
FolderItemInfo is the return value of BrowserOrganization.GetFolderItems().
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FolderItemInfo
# See Also
FolderItemInfo Members
Autodesk.Revit.DB Namespace